# 데이터 프레임 생성

# Dict 를 통한 데이터 프레임 생성 ------------------------------------------------
import pandas as pd

df = pd.DataFrame({'a': [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
print(df)


'''
가로 행(칼럼) , 세로 열(인덱스)
df = pd.DataFrame({'a': [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})

딕션너리 구조 
키 : 리스트(행열 길이가 맞아야 한다! 3x5 이면 모든 칼럼과 인덱스가 이 형태를 가져야 한다. 
     하나라도 넘거나 부족해서는 안된다.)

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9
'''
# --------------------------------------------------------------------------------



# 타입 보기 -----------------------------------------------------------------------
print(type(df))
'''
<class 'pandas.core.frame.DataFrame'>
'''
# --------------------------------------------------------------------------------



# List 를 이용한 데이터 프레임 생성 -----------------------------------------------
import pandas as pd
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]
df2 = pd.DataFrame(a)
print(df2)



'''
!출력 순서 주의! 

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

'''

# --------------------------------------------------------------------------------



# 컬럼(가로) 바꾸기 ---------------------------------------------------------------
import pandas as pd
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]
df2 = pd.DataFrame(a)
print(df2,"\n")

df2.columns = ['a', 'b', 'c']
print(df2)


'''
   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9 

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

'''

# --------------------------------------------------------------------------------





# 인덱스(새로) 바꾸기 ---------------------------------------------------------------
import pandas as pd
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]
df2 = pd.DataFrame(a)
print(df2,"\n")

df2.index = ['a', 'b', 'c']
print(df2)


'''
   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9 

   0  1  2
a  1  4  7
b  2  5  8
c  3  6  9

'''





# 이렇게 사용할 수 도 있다.
import pandas as pd
index = ['a', 'b', 'd', 'c', 'e', 'f', 'g', 'g', 'h', 'i']
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]}, index = index)
print(df)



'''
    a   b   c
a   1  11  21
b   2  12  22
d   3  13  23
c   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30
'''


# --------------------------------------------------------------------------------





# ex) ----------------------------------------------------------------------------
import pandas as pd
a = {'company' : ['abc', '회사', 123], '직원수' : [400, 10, 6]}
df2 = pd.DataFrame(a)
print(df2,"\n")


'''
   company   직원수
0     abc    400
1     회사   10
2     123    6 
'''



# --------------------------------------------------------------------------------



# 주의 ----------------------------------------------------------------------------
# 결치값은 쓸 수 없다.
import pandas as pd
a = {'company' : ['abc', '회사', 123], '직원수' : [400, 10, 6], '위치' : ['Seoul', NaN, 'Busan']}
df2 = pd.DataFrame(a)
print(df2,"\n")


'''
변수 취급
error

이를 해결하고자 공백을 둠었다!
'''


import pandas as pd
a = {'company' : ['abc', '회사', 123], '직원수' : [400, 10, 6], '위치' : ['Seoul', , 'Busan']}
df2 = pd.DataFrame(a)
print(df2,"\n")




'''
공백도 error 가 난다. 행x열의 크기를 맞추지 않은 것으로 간주한다.
error

이 문제는 numpy를 통해서 해결한다.
'''


import pandas as pd
import numpy as np
a = {'company' : ['abc', '회사', 123], '직원수' : [400, 10, 6], '위치' : ['Seoul', np.NaN, 'Busan']}
df5 = pd.DataFrame(a)
print(df5)


'''
   company    직원수     위치
0       abc    400       Seoul
1       회사    10       NaN
2       123     6        Busan
'''

# --------------------------------------------------------------------------------








