3.copy 를 이용한 데이터 복사

# 변수명을 복제하여 해결???------------------------------------------------------

import pandas as pd
df = pd.DataFrame({'a': [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
# 변수 넣으므로써 복제???
df2 = df

# df 만 칼럼을 바꾸었는데
df.columns = ['d', 'e', 'f']

print(df,"\n")
print(df2)


'''
   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9 

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9


두 변수다 바꾼다. 판다스로 만든 객체를 변수에 넣는 것은 
변수는 문 역할만 한다.

df   -- 객체
df2  --

이런 구조이다.

df   -- 객체
df2  -- 객체2 

이런 구조가 아니다.


'''
# --------------------------------------------------------------------------------









# deep copy 를 통한 해결 -----------------------------------------------------

import copy
import pandas as pd
df = pd.DataFrame({'a': [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df2 = copy.deepcopy(df)

df.columns = ['d', 'e', 'f']

print(df,"\n")
print(df2)



'''
   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9 

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9
'''




# --------------------------------------------------------------------------------

