
# 시리즈란? -----------------------------------------------------------------

import pandas as pd

df = pd.DataFrame({'a': [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
print(df ,"\n")

print(df["a"],"\n")

print(type(df['a']),"\n")

'''
   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9 

0    1
1    2
2    3
Name: a, dtype: int64 

<class 'pandas.core.series.Series'> 

칼럼 하나만 출력해서 보면 그 타입이 시리즈라고 뜬다.
한 줄씩 출력되는 형태를 시리즈라고 한다. 
'''

# --------------------------------------------------------------------------------








# 시리즈 생성 방법------------------------------------------------------------

import pandas as pd

a = pd.Series([1, 2, 3, 1, 2, 3])
print(a)

'''
0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64
'''

# --------------------------------------------------------------------------------










# 인덱스 변경------------------------------------------------------------------

import pandas as pd

a = pd.Series([1, 2, 3, 1, 2, 3])
print(a,"\n")

a = pd.Series([1, 2, 3, 1, 2, 3], index = ['a', 'b', 'c', 'd', 'e', 'f'])
print(a)



'''
0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64 

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64
'''
# --------------------------------------------------------------------------------







# 특정 인덱스 값 찾기--------------------------------------------------------

import pandas as pd

a = pd.Series([1, 2, 3, 1, 2, 3])
print(a,"\n")

a = pd.Series([1, 2, 3, 1, 2, 3], index = ['a', 'b', 'c', 'd', 'e', 'f'])
print(a,'\n')

print(a['e'])


'''
0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64 

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64 

2
'''




import pandas as pd
df = pd.DataFrame({'a': [1, 2, 3, 1, 2, 3], 'b' : [4, 5, 6, 6, 7, 8], 'c' : [7, 8, 9, 10, 11, 12]})
print(df['a'],"\n")
print(type(df['a']),"\n")
print(df['a'].unique(),"\n")       # a를 집합화 한다.
print(df['a'].unique()[2],"\n")    # 집합화된 a의 2번째 인덱스 출력.




'''
0    1
1    2
2    3
3    1
4    2
5    3
Name: a, dtype: int64 

<class 'pandas.core.series.Series'> 

[1 2 3] 

3 
'''

# --------------------------------------------------------------------------------







# a, b 열을 추출하시오.--------------------------------------------------------

import pandas as pd
df = pd.DataFrame({'a': [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
print(df["a","b"])

'''
error
두 개 이상의 데이터는 이렇게 출력하는 것이 아니다. 
다음 단원에 나온다.
'''

# --------------------------------------------------------------------------------



