
# a 가 3 이상인 데이터를 출력하시오----------------------------------------

import pandas as pd

df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
print(df,'\n')
print(df[df['a'] >= 3])   	# df[조건]



'''
     a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30 

     a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

'''

# --------------------------------------------------------------------------------










# a 가 3 이상인 데이터 중 a, c 열만 출력하시오----------------------------

import pandas as pd

df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
print(df,'\n')
print(df[df['a'] >= 3][['a', 'c']])   	# df[조건][범위]



'''
    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30 

    a   c
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

'''


# a 가 3 이상이고, b 가 16 미만인 데이터를 출력하시오.------------------

import pandas as pd

df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
print(df,'\n')
print(df[(df['a'] >= 3) & (df['b'] < 16)])       # df[조건][범위]


'''
     a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30 

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

'''



# --------------------------------------------------------------------------------












# 시리즈로 출력시 참,거짓으로 출력된다------------------------------------
# 변수에 넣으면 시리즈로 출력되며 T/F로 출력된다.

import pandas as pd

df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
print(df,'\n')
a = (df['a'] >= 3) & (df['b'] < 16)
print(a,'\n')
print(type(a))       


'''
     a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30 

0    False
1    False
2     True
3     True
4     True
5    False
6    False
7    False
8    False
9    False
dtype: bool 

<class 'pandas.core.series.Series'>

'''



# --------------------------------------------------------------------------------






#  a 가 3 이하 이거나 7 이상인 데이터를 출력하시오.----------------------
import pandas as pd

df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
print(df,'\n')
print(df[(df['a'] <= 3) | (df['a'] >= 7)])       # df[조건][범위]



'''
     a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30 

     a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

'''



# --------------------------------------------------------------------------------









# a 가 3 이상이고, b 가 16 미만이거나 c 가 30 인 데이터를 출력하시오.--

import pandas as pd

df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
print(df,'\n')
print(df[(df['a'] >= 3) & ((df['b'] < 16) | (df['c'] == 30))])       # df[조건][범위]




'''
    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30 

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30


'''

# --------------------------------------------------------------------------------
