
#판다스에서 타입 변환을 하려면 무조건 해당 변수로 받아야 한다.

# 타입변환하는 이유 ----------------------------------------------------
# 사람 눈에는 숫자지만 컴타에게는 문자다!

import pandas as pd

df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5/14/21', '5/15/21'],
                   '판매량' : ['10', '15', '20', '25', '30'], '방문자수' : ['10', '-', '17', '23', '25'], 
                   '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})

print(df.dtypes)

print(df['판매량 보정'] = df['판매량'] + 1)


# ---------------------------------------------------------------------------


# 타입 확인--------------------------------------------------------------

import pandas as pd

df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5/14/21', '5/15/21'],
                   '판매량' : ['10', '15', '20', '25', '30'], '방문자수' : ['10', '-', '17', '23', '25'], 
                   '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})
print(df,'\n')
print(df.dtypes)

'''
       판매일 판매량 방문자수    기온
0  5/11/21  10   10  24.1
1  5/12/21  15    -  24.3
2  5/13/21  20   17  24.8
3  5/14/21  25   23    25
4  5/15/21  30   25  25.4 

판매일     object
판매량     object
방문자수    object
기온      object
dtype: object

dtype이 object인 상태로는 더할 수 없다.
'''


# ---------------------------------------------------------------------------







# 변환법--------------------------------------------------------------------
# df.astype({'칼럼명' : '타입'})

import pandas as pd

df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5/14/21', '5/15/21'],
                   '판매량' : ['10', '15', '20', '25', '30'], '방문자수' : ['10', '-', '17', '23', '25'], 
                   '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})
print(df,'\n')

df=df.astype({'판매량' : 'int'})
#변수받아서 사용해야한다.

df['판매량 보정'] = df['판매량'] + 1
# 이렇게 하면 칼럼이 추가된다.

print(df,'\n')

'''
    판매일    판매량 방문자수    기온
0  5/11/21   10   	 10  	    24.1
1  5/12/21   15   	  -  	    24.3
2  5/13/21   20   	 17  	    24.8
3  5/14/21   25   	 23    	    25
4  5/15/21   30   	 25  	    25.4 

   판매일  판매량  방문자수    기온  판매량 보정
0  5/11/21   10    10             24.1      11
1  5/12/21   15     -              24.3      16
2  5/13/21   20    17             24.8      21
3  5/14/21   25    23             25      26
4  5/15/21   30    25             25.4      31 

'''

# ---------------------------------------------------------------------------











# 방문자수를 숫자 타입으로 변형 하시오.-------------------------------
# 칼럼의 데이터에 - 같은 특수 기호가 있으면 숫자형으로 당연히 변환되지 않는다.
# 보통 이 경우는 결측값으로 처리한다.
# 판다스 지정명..to_numeric(판다스변수명.['칼럼명'])
# 이렇게 쓰이는데 오류가 날 수 있다.
# 이 경우 옵션 errors = 'coerce' 을 사용하여 해결한다.

import pandas as pd

df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5/14/21', '5/15/21'],
                   '판매량' : ['10', '15', '20', '25', '30'], '방문자수' : ['10', '-', '17', '23', '25'], 
                   '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})
print(df,'\n')


# df = df.astype({'방문자수' : 'int'}) 	안된다.
# pd.to_numeric(df['방문자수'])	안된다.

pd.to_numeric(df['방문자수'], errors = 'coerce')

df['방문자수'] = pd.to_numeric(df['방문자수'], errors = 'coerce')
#무조건 해당 변수로 받아야 한다.

print(df)



'''
       	판매일   판매량 	방문자수    기온
0  	5/11/21   10   	10  	   24.1
1 	5/12/21   15    	 -  	   24.3
2  	5/13/21   20   	17  	   24.8
3  	5/14/21   25   	23    	   25
4  	5/15/21   30   	25  	   25.4 


       	판매일   판매량  방문자수    기온
0  	5/11/21  10       10.0  	24.1
1  	5/12/21  15       NaN  	24.3
2  	5/13/21  20       17.0  	24.8
3  	5/14/21  25       23.0   	25
4  	5/15/21  30       25.0  	25.4


여기서 한 가지 더 눈여겨 볼 것은 
위 판다스에
df = df.astype({'방문자수' : 'int'})
을 하면 결측값 땜에 오류가 난다.
해당 행의 값을 제거하는 것도 하나의 방법이다.
'''


import pandas as pd

df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5/14/21', '5/15/21'],
                   '판매량' : ['10', '15', '20', '25', '30'], '방문자수' : ['10', '-', '17', '23', '25'], 
                   '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})
print(df,'\n')
pd.to_numeric(df['방문자수'], errors = 'coerce')
df['방문자수'] = pd.to_numeric(df['방문자수'], errors = 'coerce')
print(df,'\n')
df.fillna(0, inplace = True)
print(df,'\n')

# 이제 바꿀 수 있다 해당 변수로 받아야한다.
df = df.astype({'방문자수' : 'int'})
print(df,'\n')
print(df.dtypes)


'''
원본
       판매일 판매량 방문자수    기온
0  5/11/21  10   10  24.1
1  5/12/21  15    -  24.3
2  5/13/21  20   17  24.8
3  5/14/21  25   23    25
4  5/15/21  30   25  25.4 

결측값 처리
       판매일 판매량  방문자수    기온
0  5/11/21  10  10.0  24.1
1  5/12/21  15   NaN  24.3
2  5/13/21  20  17.0  24.8
3  5/14/21  25  23.0    25
4  5/15/21  30  25.0  25.4 

결측값 변경
       판매일 판매량  방문자수    기온
0  5/11/21  10  10.0  24.1
1  5/12/21  15   0.0  24.3
2  5/13/21  20  17.0  24.8
3  5/14/21  25  23.0    25
4  5/15/21  30  25.0  25.4 

타입 변환
       판매일 판매량  방문자수    기온
0  5/11/21  10    10  24.1
1  5/12/21  15     0  24.3
2  5/13/21  20    17  24.8
3  5/14/21  25    23    25
4  5/15/21  30    25  25.4 

확인
판매일     object
판매량     object
방문자수     int32
기온      object
dtype: object


'''
# ---------------------------------------------------------------------------








# 판매일을 datetime 의 형태로 바꾸시오.-----------------------------
# to_datetime(df['판매일'], format="%m/%d/%y") >> datetime 으로 바꾼다


import pandas as pd

df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5/14/21', '5/15/21'],
                   '판매량' : ['10', '15', '20', '25', '30'], '방문자수' : ['10', '-', '17', '23', '25'], 
                   '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})
pd.to_numeric(df['방문자수'], errors = 'coerce')
df['방문자수'] = pd.to_numeric(df['방문자수'], errors = 'coerce')
df.fillna(0, inplace = True)
df = df.astype({'방문자수' : 'int'})

df['판매일'] = pd.to_datetime(df['판매일'], format="%m/%d/%y")
print(df,'\n')
print(df.dtypes)


'''
         판매일 판매량  방문자수    기온
0 2021-05-11  10    10  24.1
1 2021-05-12  15     0  24.3
2 2021-05-13  20    17  24.8
3 2021-05-14  25    23    25
4 2021-05-15  30    25  25.4 

판매일     datetime64[ns]
판매량             object
방문자수             int32
기온              object
dtype: object

'''

# ---------------------------------------------------------------------------

