
# 칼럼 추가---------------------------------------------------------------
# 그냥 칼럼 하나 변수로 받으면 된다.
# 그런데 변수에 값 하나만 적으면 모든 값이 하나로 통일된다.

import pandas as pd

df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
print(df,'\n')
df['d'] = [1, 3, 6, 4, 8]
print(df,'\n')
df['e'] = 1
print(df,'\n')


'''
원본
   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4 

추가
   a  b  c  d
0  1  2  3  1
1  1  3  4  3
2  3  2  7  6
3  4  3  6  4
4  5  4  4  8 

하나로 통일시켜서 추가
   a  b  c  d  e
0  1  2  3  1  1
1  1  3  4  3  1
2  3  2  7  6  1
3  4  3  6  4  1
4  5  4  4  8  1 


'''


# ---------------------------------------------------------------------------



# a + b - c 의 결과로 이루어진 f 칼럼을 추가하시오. ------------------
# 자체 연산 가능하다


import pandas as pd

df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df['d'] = [1, 3, 6, 4, 8]
df['e'] = 1
df['f'] = df['a'] + df['b'] - df['c']
print(df,'\n')



'''
   a  b  c  d  e  f
0  1  2  3  1  1  0
1  1  3  4  3  1  0
2  3  2  7  6  1 -2
3  4  3  6  4  1  1
4  5  4  4  8  1  5 


'''

# ---------------------------------------------------------------------------












# 칼럼 삭제 ---------------------------------------------------------------
# 판다스 변수명.drop['삭제할 칼럼','삭제할 칼럼' ....]  >> 해달 칼럼을 삭제한다.
# 저장해야 적용된다.


import pandas as pd

df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df['d'] = [1, 3, 6, 4, 8]
df['e'] = 1
df['f'] = df['a'] + df['b'] - df['c']
print(df,'\n')
df.drop(['d', 'e', 'f'], axis=1 ,inplace=True)
print(df,'\n')



'''
원본
   a  b  c  d  e  f
0  1  2  3  1  1  0
1  1  3  4  3  1  0
2  3  2  7  6  1 -2
3  4  3  6  4  1  1
4  5  4  4  8  1  5 

삭제
   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4 


'''

# ---------------------------------------------------------------------------







# 레코드 추가-------------------------------------------------------------
# 원래 있는 칼럼에 값을 추가시키기 
# 판다스변수명.append({'칼럼명': 값,'칼럼명': 값,'칼럼명': 값} , ignore_index = True)
# 본래는 인덱스를 지정해야하지만 바로 아래에 넣을 거라면 ignore_index = True 설정을 이용하면 된다.

import pandas as pd
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df=df.append({'a' : 6, 'b' : 7, 'c' : 8} , ignore_index=True)
# 변수에 넣어야 들어간다.
print(df,'\n')


'''
   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8 
'''


#위치를 정해서 넣기
import pandas as pd
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df=df.append({'a' : 6, 'b' : 7, 'c' : 8} , ignore_index=True)
df.loc[6] = [7, 8, 9]
print(df,'\n')


'''
     a   b   c
0   1   2   3
1   1   3   4
2   3   2   7
3   4   3   6
4   5   4   4
5   6   7   8
6  17  18  19 

'''

# ---------------------------------------------------------------------------








# 레코드 삭제-------------------------------------------------------------


import pandas as pd
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df=df.drop(0)
#해당 변수에 넣어야 작동한다.
print(df,'\n')

'''
   a  b  c
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4 

'''



#범위지정 삭제

# ex.1) ------------------------------------------------------------
import pandas as pd
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df = df.drop([0, 1])
#해당 변수에 넣어야 작동한다.
print(df,'\n')

'''
   a  b  c
2  3  2  7
3  4  3  6
4  5  4  4 

'''


# ex.2) ------------------------------------------------------------

import pandas as pd
df = pd.DataFrame({'a' : [1, 1, 3, 4, 5], 'b' : [2, 3, 2, 3, 4], 'c' : [3, 4, 7, 6, 4]})
df = df.drop([i for i in range(4)])
# 반복문을 이용하여 삭제 가능
print(df,'\n')


'''
   a  b  c
4  5  4  4 


df.drop(df.index[:4]) 도 가능
df.drop(df[df['a'] < 4].index) 조건문으로도 가능
df.drop(df[(df['a'] < 3) & (df['c'] == 4)].index)
'''

# ---------------------------------------------------------------------------

